Revit 2027 API
BuiltInFailures.SketchFailures.ClosedProfileRoof Property
 Extrusion roof sketch must be open. The roof's thickness and material composition are defined in its type.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId ClosedProfileRoof { get; }
Public Shared ReadOnly Property ClosedProfileRoof As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ ClosedProfileRoof {
	FailureDefinitionId^ get ();
}
static member ClosedProfileRoof : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.SketchFailures Class
Autodesk.Revit.DB Namespace